woshiqingteng/stm32-example/bsp/openedv_stm32f4/usart.h
/**
 * @file    usart.h
 * @brief   USART1 interface (TX via _write, RX line reception).
 */

#ifndef BSP_USART_H
#define BSP_USART_H

#include <stdint.h>
#include <stdbool.h>
#include "stm32f4xx_hal.h"

#define USART_REC_LEN 200U

typedef enum
{
    USART_RX_IDLE = 0,  /*!< waiting for the start of a line */
    USART_RX_RECEIVING, /*!< line in progress */
    USART_RX_READY,     /*!< complete line in the buffer */
    USART_RX_OVERFLOW   /*!< line too long, discarded until the next terminator */
} usart_rx_state_t;

/** @brief Callback invoked for every byte received on USART1. */
typedef void (*usart_rx_byte_cb_t)(uint8_t byte);

extern UART_HandleTypeDef g_uart1_handle;

/** @brief  Initialise USART1 (PA9 TX / PA10 RX) and start line reception. */
void usart_init(uint32_t baudrate);

/** @brief  Register (or clear with 0) the per-byte receive hook. */
void usart_register_rx_byte_hook(usart_rx_byte_cb_t cb);

usart_rx_state_t usart_rx_state(void);
uint16_t usart_rx_len(void);
const uint8_t *usart_rx_buf(void);
void usart_rx_clear(void);

/** @brief  Initialise USART1 TX over DMA2 Stream7 / channel 4. */
void usart_tx_dma_init(void);

/** @brief  True while a DMA transfer is in progress. */
bool usart_tx_dma_busy(void);

/** @brief  Start a DMA transmit; returns false if the USART is still busy. */
bool usart_tx_dma(const uint8_t *data, uint16_t len);

/* ---- USART2 (PA2 TX / PA3 RX), transmit-only, blocking ---- */

extern UART_HandleTypeDef g_uart2_handle;

/** @brief  Initialise USART2 in transmit-only mode. */
void usart2_init(uint32_t baudrate);

/** @brief  Blocking transmit of a buffer over USART2. */
void usart2_write(const uint8_t *data, uint32_t len);

/** @brief  Blocking transmit of one byte over USART2. */
void usart2_write_byte(uint8_t byte);

#endif /* BSP_USART_H */
